code-review/NRB_3471_3546/База_Было/Documents/ВыгрузкаРазделаРСВвВышестоящийДепозитарий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыгрузкаРазделаРСВвВышестоящийДепозитарий</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РаскрытиеСпискаВладельцев</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/СостоянияДокументовВФайловомШлюзе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовВФайловомШлюзе</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящийПакетВФайловыйШлюз</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийПакетИзФайловогоШлюза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ВыгрузкаРазделаРСВвВышестоящийДепозитарий/Ext/ManagerModule.bsl
// Подготавливает запрос состояний выгрузок разделов указанного РСВ
//
// Параметры:
//  РСВ		 - ДокументСсылка.РаскрытиеСпискаВладельцев			 - Ссылка на раскрытие, состояние которого необходимо получить
//  Разделы	 - СправочникСсылка.РазделыСчетаДепоМХ, Коллекция 	 - Массив или список ссылок на справочник , состояние которых необходимо получить
// 
// Возвращаемое значение:
//   - Запрос, готовый к выполнению
//
Функция ЗапросСостоянийВыгрузкиРазделов(РСВ, Разделы) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазделыСчетаДепоМХ.Ссылка КАК Раздел,
	|	РазделыСчетаДепоМХ.Код КАК КодРаздела,
	|	ВыгрузкаРазделаРСВвНРД.Ссылка КАК ВыгрузкаРаздела,
	|	ТехническаяОперация.Ссылка КАК ТехническаяОперация,
	|	ИсходящийПакетВФайловыйШлюз.Номер КАК НомерПакета,
	|	ИсходящийПакетВФайловыйШлюз.Дата КАК ДатаПакета,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК Статус
	|ИЗ
	|	Справочник.РазделыСчетаДепоМХ КАК РазделыСчетаДепоМХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыгрузкаРазделаРСВвВышестоящийДепозитарий КАК ВыгрузкаРазделаРСВвНРД
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТехническаяОперация КАК ТехническаяОперация
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсходящийПакетВФайловыйШлюз КАК ИсходящийПакетВФайловыйШлюз
	|				ПО ТехническаяОперация.Ссылка = ИсходящийПакетВФайловыйШлюз.ДокументОснование
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|				ПО ТехническаяОперация.Ссылка = СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ
	|			ПО ВыгрузкаРазделаРСВвНРД.Ссылка = ТехническаяОперация.ДокументОснование
	|				И (ТехническаяОперация.Ссылка В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						Документ.ТехническаяОперация.Ссылка
	|					ИЗ
	|						Документ.ТехническаяОперация
	|					ГДЕ
	|						Документ.ТехническаяОперация.ДокументОснование = ВыгрузкаРазделаРСВвНРД.Ссылка
	|					УПОРЯДОЧИТЬ ПО
	|						Документ.ТехническаяОперация.Дата УБЫВ))
	|		ПО (ВыгрузкаРазделаРСВвНРД.РазделСчетаДепоМХ = РазделыСчетаДепоМХ.Ссылка)
	|			И (ВыгрузкаРазделаРСВвНРД.РаскрытиеСпискаВладельцев = &РСВ)
	|			И (ВыгрузкаРазделаРСВвНРД.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	РазделыСчетаДепоМХ.Ссылка В(&Разделы)";
	Запрос.УстановитьПараметр("РСВ", РСВ);
	Запрос.УстановитьПараметр("Разделы", Разделы);
	Возврат Запрос;
КонецФункции

// Формирует название пакета ORDSW
//
// Параметры:
//  Дата	 - Дата		- День выгрузки пакета
//  Номер	 - Число	- Порядковый номер пакета в течение дня
// 
// Возвращаемое значение:
//   - имя файла без расширения (и каталога, в который должен быть сохранён файл)
//
Функция ИмяФайлаВыгрузки(Дата, Номер) Экспорт
	
	Если ЗначениеЗаполнено(Дата) И ЗначениеЗаполнено(Номер) Тогда
		Возврат "#ORDSW"+Формат(Дата, "ДФ=ddMMyy")+Формат(Номер, "ЧЦ=13; ЧВН=; ЧГ=0");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Формирует файлы пакета ORDSW для выгрузки в ФШ НРД
//
// Параметры:
//  Текст				 - Строка								 - Содержит текст файла ORDSW
//  ИмяФайла			 - Строка								 - Содержит имя папки, в которую будет записан пакет
//  Путь				 - Строка								 - Если не задан, пакет будет сохранён в каталог внешнего источника
//
Процедура СформироватьФайлыВыгрузки(Текст, ИмяФайла, Путь = "") Экспорт
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		ВызватьИсключение "Не сформирован текст пакета!";
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		ВызватьИсключение "Не задано имя сохраняемого пакета!";
	КонецЕсли;
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогКОтправке;
	Если Путь = "" Тогда
		Путь = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Папка;
	КонецЕсли;
	Если ЗначениеЗаполнено(Путь) Тогда
		Путь = СокрП(Путь);
		Если Прав(Путь, 1) <> "\" Тогда
			Путь = Путь + "\";
		КонецЕсли;
	Иначе
		ВызватьИсключение "Не задан каталог для сохранения ("+ВнешнийИсточник.Наименование+")";
	КонецЕсли;
	
	СоздатьКаталог(Путь+ИмяФайла);
	ТекстовыйФайл = Новый ЗаписьТекста(Путь+ИмяФайла+"\"+ИмяФайла+".txt");
	ТекстовыйФайл.Записать(Текст);
	ТекстовыйФайл.Закрыть();
	
	XMLФайл = Новый ЗаписьXML;
	XMLФайл.ОткрытьФайл(Путь+ИмяФайла+"\config.xml");
	XMLФайл.ЗаписатьНачалоЭлемента("config");
		XMLФайл.ЗаписатьНачалоЭлемента("name");
			XMLФайл.ЗаписатьТекст(ИмяФайла+".txt");
		XMLФайл.ЗаписатьКонецЭлемента(); // name
		XMLФайл.ЗаписатьНачалоЭлемента("package");
			XMLФайл.ЗаписатьТекст("#ORDSW");
		XMLФайл.ЗаписатьКонецЭлемента(); // package
	XMLФайл.ЗаписатьКонецЭлемента(); // config
	XMLФайл.Закрыть();
	
КонецПроцедуры

// Формирует текст для выгрузки пакета ORDSW
//
// Параметры:
//  Раскрытие			 - ДлкументОбъект.РаскрытиеСпискаВладельцев	 - Объект документа РаскрытиеСпискаВладельцев, по которому формируется пакет
//  ВыборкаРазделСчетаМХ - ВыборкаИзРезультатаЗапроса				 - Выборка данных сводного раскрытия, по которому формируется пакет
//  РазделСчетаДепоМХ	 - СправочникСсылка.РазделыСчетаДепоМХ		 - Раздел, по которому формируется пакет
//
Функция ТекстФайлаВыгрузки(Раскрытие, ВыборкаРазделСчетаМХ, РазделСчетаДепоМХ) Экспорт
	
	Текст = Новый ТекстовыйДокумент;
	
	Макет = ПолучитьМакет("Шаблон");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ДопустимыеСимволы = СтроковыеФункцииКлиентСервер.НаборыДопустимыхСимволовSWIFTСообщений();
	Если Раскрытие.ШапкаСводного.Количество() > 0 Тогда //данные хранятся в документе
		ПараметрыШапки = Новый Структура;
		Для Каждого Строка Из Раскрытие.ШапкаСводного Цикл
			Если ТипЗнч(Строка.Значение) = Тип("Дата") Тогда
				Значение = Формат(Строка.Значение, "Л=en_GB; ДЛФ=DD");
			Иначе
				Значение = СтроковыеФункцииКлиентСервер.СтрокаТолькоДопустимыхСимволов(Строка.Значение, ДопустимыеСимволы.НаборX, " ");
			КонецЕсли;
			ПараметрыШапки.Вставить(Строка.Ключ, Значение);
		КонецЦикла;
	Иначе // выгружаем по старой логике
		НаименованиеЦБ = СтрЗаменить(СокрЛП(Раскрытие.ЦеннаяБумага1.Наименование), "&", "d");
		
		ПараметрыШапки = Новый Структура("SwiftCode,CorpActionNumber,SecurityCode,SecurityName,AccountNumber"
		, КодSWIFT(Раскрытие.Организация)
		, СокрЛП(Раскрытие.СвязанныйРеференсКД2)
		, СокрЛП(Раскрытие.ЦеннаяБумага1.ISIN)
		, СтроковыеФункцииКлиентСервер.СтрокаТолькоДопустимыхСимволов(НаименованиеЦБ, ДопустимыеСимволы.НаборX, " ")
		, СокрЛП(Раскрытие.СчетДЕПО.Код));
	КонецЕсли;
	Шапка.Параметры.Заполнить(ПараметрыШапки);
	Текст.Вывести(Шапка);
	
	Сформирован = Ложь;
	Количество = 0;
	Если Раскрытие.СводноеРаскрытие.Количество() > 0 Тогда //данные хранятся в документе
		
		Строки = Раскрытие.СводноеРаскрытие.НайтиСтроки(Новый Структура("РазделСчетаДепоМХ,СчетДепоМХ", РазделСчетаДепоМХ
		, Справочники.СчетаДепоМХ.ПустаяСсылка())); //счет заполнен только в детальных записях, которые нам не нужны
		Строка = Строки[0];
		Если Строка.НалоговаяСтавка <> Неопределено Или Строка.СтатусПоГлаве4 <> Неопределено Тогда // сначала должен быть итог по разделу
			ВызватьИсключение "Ошибка в структуре хранения сводного раскрытия по разделу '"+РазделСчетаДепоМХ+"'!";
		КонецЕсли;
		ПараметрыШапки.Вставить("SubAccount", СокрЛП(Строка.РазделСчетаДепоМХ));
		ПараметрыШапки.Вставить("TotalBalance", Формат(Строка.КоличествоЦБ, "ЧГ=0"));
		Раздел = Макет.ПолучитьОбласть("Раздел");
		Раздел.Параметры.Заполнить(ПараметрыШапки);
		Текст.Вывести(Раздел);
		
		Для Каждого Строка Из Строки Цикл
			Если ЗначениеЗаполнено(Строка.СтатусПоГлаве4) Тогда // это итог по статусу
				Количество = Количество + Строка.КоличествоЦБ;
				Ставка = Макет.ПолучитьОбласть("Ставка");
				ПараметрыСтавки = Новый Структура("Quantity,TaxRate,RatePool"
				, Формат(Строка.КоличествоЦБ, "ЧГ=0")
				, Строка(Строка.НалоговаяСтавка)
				, СокрЛП(Строка.СтатусПоГлаве4));
				Ставка.Параметры.Заполнить(ПараметрыСтавки);
				Текст.Вывести(Ставка);
			КонецЕсли;
		КонецЦикла;
		
		Если Количество = 0 Тогда
			ВызватьИсключение "Ошибка в данных раскрытия, не заполнены статусы по главе 4!";
		КонецЕсли;
		
	Иначе // выгружаем по старой логике	
		
		Пока ВыборкаРазделСчетаМХ.Следующий() Цикл
			
			Если ВыборкаРазделСчетаМХ.РазделСчетаДепоМХ <> РазделСчетаДепоМХ Тогда
				Продолжить;
			КонецЕсли;
			
			Раздел = Макет.ПолучитьОбласть("Раздел");
			ПараметрыРаздела = Новый Структура("SubAccount,DepositorCode,QI_EIN,RecordDate,TotalBalance,AllocationType"
			, СокрЛП(ВыборкаРазделСчетаМХ.РазделСчетаДепоМХ)
			, КодНРД(Раскрытие) // "MC0292900000"
			, Раскрытие.Организация.QI_EIN // "980243432"
			, Формат(Раскрытие.ДатаФиксации, "Л=en_GB; ДЛФ=DD")
			, Формат(ВыборкаРазделСчетаМХ.КоличествоЦБ, "ЧГ=0")
			, "pooled");
			Раздел.Параметры.Заполнить(ПараметрыРаздела);
			Текст.Вывести(Раздел);
			
			ВыборкаНалоговаяСтавка = ВыборкаРазделСчетаМХ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНалоговаяСтавка.Следующий() Цикл
				ВыборкаСтатусПоГлаве4 = ВыборкаНалоговаяСтавка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСтатусПоГлаве4.Следующий() Цикл
					Количество = Количество + ВыборкаСтатусПоГлаве4.КоличествоЦБ;
					Ставка = Макет.ПолучитьОбласть("Ставка");
					ПараметрыСтавки = Новый Структура("Quantity,TaxRate,RatePool"
					, Формат(ВыборкаСтатусПоГлаве4.КоличествоЦБ, "ЧГ=0")
					, Строка(ВыборкаСтатусПоГлаве4.НалоговаяСтавка)
					, СокрЛП(ВыборкаСтатусПоГлаве4.СтатусПоГлаве4));
					Ставка.Параметры.Заполнить(ПараметрыСтавки);
					Текст.Вывести(Ставка);
				КонецЦикла;
			КонецЦикла;
			
			Сформирован = Истина;
		КонецЦикла;
		
		Если Не Сформирован Тогда
			ВызватьИсключение "В данных раскрытия не найден раздел '"+РазделСчетаДепоМХ+"'!";
		КонецЕсли;
		
	КонецЕсли;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ПараметрыПодвала = Новый Структура("Quantity", Формат(Количество, "ЧГ=0"));
	Подвал.Параметры.Заполнить(ПараметрыПодвала);
	Текст.Вывести(Подвал);
	
	Возврат Текст.ПолучитьТекст();
	
КонецФункции

Функция КодSWIFT(Организация)
	
	Код = Организация.QI_SWIFT;
	Если ПустаяСтрока(Код) Тогда
		Возврат "";
	Иначе
		Возврат Лев(Код, 8) + "A" + Сред(Код, 9, 3) + "0000000000";
	КонецЕсли;
	
КонецФункции

Функция КодНРД(Раскрытие)
	
	НДЦ = Константы.КлассификаторЗагрузкиНДЦ.Получить();
	КодНРД = Справочники.Организации.КодЗагрузки(Раскрытие.Организация, НДЦ, Раскрытие.ДатаФиксации);
	Возврат КодНРД;
	
КонецФункции
